Revit 2027 API
ParameterTypeId.AnalyticalModelSurfaceElementsMark Property
 "Surface Number": Used for floors, slabs, walls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelSurfaceElementsMark { get; }
Public Shared ReadOnly Property AnalyticalModelSurfaceElementsMark As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelSurfaceElementsMark {
	ForgeTypeId^ get ();
}
static member AnalyticalModelSurfaceElementsMark : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace